# LAB | Connecting Python to SQL

<details>
  <summary>
   <h2>Learning Goals</h2>
  </summary>

  This lab allows you to practice and apply the concepts and techniques taught in class. 

  Upon completion of this lab, you will be able to:
  
- Write a Python script to connect to a relational database using the appropriate Python library and query it using SQL commands.

  <br>
  <hr> 

</details>

<details>
  <summary>
   <h2>Prerequisites</h2>
  </summary>

Before this starting this lab, you should have learnt about:

- Basic SQL queries
- Python and Pandas 
- Data Wrangling, which involves tasks such as grouping, aggregating, dealing with indexes, renaming columns, merging data and performing calculations.
 
  <br>
  <hr> 

</details>


## Introduction

Welcome to the Connecting Python to SQL lab!

In this lab, you will be working with the [Sakila](https://dev.mysql.com/doc/sakila/en/) database on movie rentals. Specifically, you will be practicing how to do basic SQL queries using Python. By connecting Python to SQL, you can leverage the power of both languages to efficiently manipulate and analyze large datasets. Throughout this lab, you will practice how to use Python to retrieve and manipulate data stored in the Sakila database using SQL queries. Let's get started!

## Challenge

In this lab, the objective is to identify the customers who were active in both May and June, and how did their activity differ between months. To achieve this, follow these steps:

1. Establish a connection between Python and the Sakila database.

In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

import getpass

In [2]:
password = getpass.getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

2. Write a Python function called `rentals_month` that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

	- `engine`: an object representing the database connection engine to be used to establish a connection to the Sakila database.
	- `month`: an integer representing the month for which rental data is to be retrieved.
	- `year`: an integer representing the year for which rental data is to be retrieved.

	The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

In [4]:
def rentals_month (engine, month: int, year: int) -> pd.DataFrame:
    """
    Function retrieves rental data for a given month and year from a given database.
    Input:  engine as object
            month as int
            year as int
    Output: Data Frame filtered for the selcted month and year.
    
    """
    query = f"""SELECT * 
    FROM rental 
    WHERE MONTH(rental_date)={month} AND YEAR(rental_date)={year}"""
    rental_data = pd.read_sql_query(query, engine)
    return rental_data

In [6]:
rentals_05_25 = rentals_month(engine, month=5, year=2005)
rentals_05_25.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53

In [7]:
rentals_06_25 = rentals_month(engine, month=6, year=2005)

3. Develop a Python function called `rental_count_month` that takes the DataFrame provided by `rentals_month` as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year. 

	The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".


	*Hint: Consider making use of pandas [groupby()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html)*

In [8]:
def rental_count_month (df: pd.DataFrame, month: int, year: int):
    """
    Takes rental information along with its month and year and returns a new dataframe with the amount of rentals
    made by every customer within that selected time.
    Renames the column names in alignment to the month and year from the input.
    """
    rental_count_month_df = df.groupby(['customer_id'])['rental_id'].agg('count').reset_index()
    rental_count_month_df.columns = ['customer_id', f'rentals_{month}_{year}']
    return rental_count_month_df

In [9]:
rentals_count_05_25 = rental_count_month(rentals_05_25, 5, 2005)
rentals_count_06_25 = rental_count_month(rentals_06_25, 6, 2005)

4. Create a Python function called `compare_rentals` that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. 
The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [10]:
def compare_rentals (df1: pd.DataFrame, df2: pd.DataFrame):
    """
    Function that merges two dataframes based on the customer_id and returns a new dataframe with an added column
    that calculated the difference between the two columns.
    """
    df_comparison = pd.merge(df1, df2, on='customer_id')
    df_comparison['difference'] = df1.iloc[:,1] - df2.iloc[:,1]
    return df_comparison

In [11]:
compare_rentals(rentals_count_05_25,rentals_count_06_25)

     customer_id  rentals_5_2005  rentals_6_2005  difference
0              1               2               7        -5.0
1              2               1               1         0.0
2              3               2               4        -2.0
3              5               3               5        -3.0
4              6               3               4        -2.0
..           ...             ...             ...         ...
507          594               4               6        -4.0
508          595               1               2         1.0
509          596               6               2        -1.0
510          597               2               3        -1.0
511          599               1               4         0.0

[512 rows x 4 columns]